app/controllers/events_controller.rb

INSERT INTO "events" ("title", "description", "start_date", "end_date", "venue", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @event = Event.new(event_params)
        if @event.save

UPDATE "events" SET "title" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "Title test Edited"], ["updated_at", "2021-09-13 14:11:19.598712"], ["id", 1]]
---
    def update
        if @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 8]]
---
    def destroy
        if @event.destroy

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
        def set_event
            @event = Event.find(params[:id])